Revit 2027 API
EmbodiedCarbonAsset Constructor
 Constructs an instance of EmbodiedCarbonAsset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EmbodiedCarbonAsset(
	string name
)
Public Sub New (
	name As String
)
public:
EmbodiedCarbonAsset(
	String^ name
)
new :
        name : string -> EmbodiedCarbonAsset
Parameters
name String
 The name of the asset.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace